app/views/courses/show.html.erb

	<p>
		<% @course.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = 1

	<p>
		<% @course.students.each do |student| %>
---
SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = 1