app/controllers/courses_controller.rb

  def create
    @course = Course.new(params[:course])
      if @course.save
---
INSERT INTO "courses" ("created_at", "link", "summary", "teacher_id", "title", "updated_at", "video") VALUES (?, ?, ?, ?, ?, ?, ?)