app/controllers/lessons_controller.rb

  def show
  	@lessons = Lesson.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @courses = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "11"]]

  def create
    @course = Course.find(params[:course_id])
    @lesson = @course.lessons.new(params[:lesson])
    if @lesson.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "11"]]
INSERT INTO "lessons" ("course_id", "created_at", "homework", "instructions", "title", "updated_at", "video") VALUES (?, ?, ?, ?, ?, ?, ?)